{
  "categoryName": "Privacy",
  "categoryDescription": "Canister smart contracts can be used to implement privacy-preserving dapps that give users full control over their data. Leveraging cryptographic protocols, ICP enables developers to build dapps where users store and share encrypted data onchain. Advanced cryptographic protocols will eventually allow computations on encrypted data.",
  "elements": [
    {
      "title": "Integrity and confidentialty of node state",
      "is_milestone": true,
      "description": "This milestone brings Trusted Execution Environments (TEEs) to the Internet Computer to provide comprehensive security guarantees. The initial focus is on node integrity, protecting the node state from tampering and keeping sensitive key shares confidential. The work culminates in ensuring complete confidentiality of canister state, ensuring all canister data is encrypted and shielded from unauthorized access, both in memory and in storage.",
      "milestone_id": "Containment",
      "status": "in_progress"
    },
    {
      "title": "TEE-capable IC-OS",
      "overview": "Adapting IC-OS to run inside SEV-SNP, ensuring it is reproducibly built, securely boots, and maintains integrity throughout its lifecycle.",
      "status": "in_progress",
      "milestone_id": "Containment"
    },
    {
      "title": "TEE Upgrades",
      "overview": "Re-architecting the upgrade process to securely handover the confidential state from the old to the new release, guaranteeing continuous integrity.",
      "status": "in_progress",
      "milestone_id": "Containment"
    },
    {
      "title": "TEE-enabled Replica Nodes",
      "overview": "Deploying single node machines with TEE-protection that can be used both as replicas and API boundary nodes.",
      "status": "in_progress",
      "milestone_id": "Containment"
    },
    {
      "title": "Encrypted canister state",
      "overview": "Ensuring that all canister state is always encrypted, both in memory and storage, making it completely inaccessible for external parties.",
      "status": "in_progress",
      "milestone_id": "Containment"
    },
    {
      "title": "Disaster recovery for SEV-SNP-enabled subnets",
      "overview": "SEV-SNP raises the level of security, but also makes disaster recovery harder. SEV-SNP-enabled subnets need to be made recoverable, e.g., by securely escrowing its secure enclave key material on the NNS.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "SEV Support for replica nodes",
      "overview": "Enabling the SEV-SNP trusted computing technology for the Replica VM to protect sensitive data from unauthorized access.",
      "forum": "https://forum.dfinity.org/t/amd-sev-virtual-machine-support/6156",
      "proposal": "https://forum.dfinity.org/t/long-term-r-d-tee-enhanced-ic-proposal/9384/4",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "SEV-SNP-enabled ECDSA subnet",
      "overview": "The threshold ECDSA signing and backup subnets are enabled with SEV-SNP to raise the protection level against data exfiltration attacks by entities with access to the nodes.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "SEV-SNP for app subnets",
      "overview": "Regular app subnets receive SEV-SNP protection to make them harder to tamper with and to enable attestation of running the correct software image.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Remote attestation for users",
      "overview": "Allowing users to verify that an API boundary node is running trusted software inside a genuine trusted execution environment.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Fully-homomorphic encryption (FHE)",
      "overview": "Fully-homomorphic encryption (FHE) allows for arbitrary computations on encrypted data and only authorized parties to decrypt the result. Blockchain data privacy.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Cryptographic multi-party computation (MPC)",
      "overview": "Running MPC on the blockchain nodes allow for privacy-preserving arbitrary computations to be made, with only authorized parties learning the results.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "",
      "is_community": false,
      "in_beta": false
    }
  ]
}
