{
  "categoryName": "Governance & Tokenomics",
  "categoryDescription": "ICP has two kinds of built-in governance systems. The NNS is the DAO governing the ICP protocol. The SNS framework is a toolbox for creating DAOs that govern individual dapps. Both are open for everyone to participate and facilitate decentralized decision making. Tokenomics incentivise voting participation and ensure that DAO decisions are aligned with the long-term interests of the ICP and the governed dapps.",
  "elements": [
    {
      "title": "Enabling governance token holdings and broader participation",
      "is_milestone": true,
      "description": "The main focus of the Neon milestone is on expanding the user base and improving the user experience. Holding governance tokens is intuitive and seamless, ensuring that new users can quickly understand their holdings and easily explore and engage with new opportunities, such as SNS launches. Additional features aim to make the governance process more intuitive and simplify SNS DAO operations, laying the basis for the next milestone.",
      "milestone_id": "Neon",
      "status": "in_progress",
      "eta_to_render": ""
    },
    {
      "title": "Portfolio page",
      "overview": "Introduce a new portfolio page for NNS dapp users where they can find an overview of their holdings and the possible actions that they can take.",
      "status": "in_progress",
      "milestone_id": "Neon"
    },
    {
      "title": "Engaged and active DAO communities",
      "is_milestone": true,
      "description": "This milestone focuses on boosting user involvement in governance. It aims to create a sense of belonging to DAO communities and encourage users to contribute to the liquid democracy processes. SNS communities can apply their decisions easily by proposals.",
      "milestone_id": "Nucleon",
      "status": "future",
      "eta": "",
      "eta_to_render": ""
    },
    {
      "title": "Periodic Followee Confirmation",
      "overview": "Require neuron owners to confirm their neurons’ following settings periodically.",
      "description": "This roadmap item is based on the community proposal 55651. Caveat: A periodic reconfirmation of neuron following would presumably (at least initially) result in an active voting power of below 50% for non-governance topics. Thus, even if all voters voted, the system would have to wait for the end of the voting period, which is problematic in case of urgent updates (e.g. update of a subnet). This limitation needs to be mitigated.",
      "forum": "https://forum.dfinity.org/t/periodic-confirmation-design/34215",
      "proposal": "https://dashboard.internetcomputer.org/proposal/55651",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true,
      "milestone_id": "Neon"
    },
    {
      "title": "Stable memory for governance",
      "overview": "Utilizing stable memory in different parts of the NNS and SNS framework will allow ICP's governance to handle a larger number of participants, preparing it for continued growth.",
      "description": "Utilizing stable memory in different parts of the NNS and SNS framework will allow ICP's governance to handle a larger number of participants, preparing it for continued growth.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "in_progress",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Neon"
    },
    {
      "title": "Large Wasm support for SNS controlled dapp canisters",
      "overview": "This simplifies owning large dapp canisters for SNS DAO communities by a built-in process to do so in the SNS framework.",
      "status": "in_progress",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Neon"
    },
    {
      "title": "Automatic SNS framework canister upgrades",
      "overview": "For easier management of the SNS framework canisters, allow SNS DAOs to opt-in to receive automatic upgrades to canisters as soon as they are approved and released by the NNS.",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Neon"
    },
    {
      "title": "Leverage liquid democracy in SNS DAOs",
      "overview": "Liquid democracy is a key component of ICP's governance systems. Further leverage the potential of this mechanism in the SNS DAOs, including by introducing SNS topics and a notion of named or known neurons.",
      "status": "in_progress",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Neon"
    },
    {
      "title": "Disburse maturity for NNS neurons",
      "overview": "Unlike SNS neurons, NNS neurons spawn maturity into a newly created neuron. This feature will move to a flow where NNS neurons would also disburse maturity.",
      "description": "In its current implementation, NNS neurons spawn maturity into a new neuron, whereas SNS DAOs disburse maturity directly into the user's account, which greatly simplifies the flow and reduces the new neurons created.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "in_progress",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Neon"
    },
    {
      "title": "SNS communities portal",
      "overview": "A redesign of the voting interface that encourages community involvement and a sense of belonging, for example by allowing for announcement and updates.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Nucleon"
    },
    {
      "title": "SNS treasury management",
      "overview": "As SNS DAOs evolve, there is a need to manage their treasuries in more sophisticated ways. This roadmap item aims to extend what SNS DAOs can do with their treasury, including holding other ICRC-1 tokens and SNS neurons, direct interaction with DEXs, and more.",
      "description": "As SNS DAOs evolve, there is a need to manage their treasuries in more sophisticated ways. This roadmap item aims to extend what SNS DAOs can do with their treasury, including holding other ICRC-1 tokens and SNS neurons, direct interaction with DEXs, and more.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Nucleon"
    },
    {
      "title": "Council-based digital assets management",
      "is_milestone": true,
      "description": "This milestone integrates Orbit’s multi-approval framework with the Network Nervous System (NNS), designating the NNS as the root of trust. By having the NNS “bless” new versions, Orbit gains a robust, decentralized governance layer without requiring each council to implement its own governance from scratch.",
      "milestone_id": "Nucleus",
      "status": "future",
      "eta_to_render": ""
    },
    {
      "title": "Root of Trust Integration",
      "overview": "The Orbit control panel and core user interface are placed under NNS control. New versions of Orbit must be “blessed” by the NNS, ensuring a community-vetted approach to upgrades and governance.",
      "status": "future",
      "milestone_id": "Nucleus"
    },
    {
      "title": "Public councils",
      "overview": "Projects can create open, trackable councils using Orbit’s multi approval tools. All key actions—like canister upgrades—are fully transparent, enabling end users to monitor and verify changes in real time.",
      "status": "future",
      "milestone_id": "Nucleus"
    },
    {
      "title": "NNS Neuron index",
      "overview": "Introduce a governance endpoint that allows to index all NNS neurons.",
      "status": "future"
    },

    {
      "title": "Improve staking user experience",
      "overview": "Simplify ICP/SNS staking process in the NNS dapp to eliminate barriers of entry for first-time users. Allow new users to quickly set up several neurons with the following strategy of their choosing.",
      "description": "Simplify ICP/SNS staking process in the NNS dapp to eliminate barriers of entry for first-time users. Allow new users to quickly set up several neurons with the following strategy of their choosing.",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false,
      "imported": false,
      "milestone_id": "Nucleon"
    },
    {
      "title": "Launchpad redesign",
      "overview": "Launchpad is one of the central places where newcomers may find SNS DAOs. This roadmap item aims to show more interesting and dynamic information about DAOs on ICP, allowing users to find opportunities and engage with new SNS launches.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Neon"
    },
    {
      "title": "Guide users from swap participating to governance",
      "overview": "After successful participation in an SNS launch, guide users to the next steps they can take. This can include using their tokens or setting up the neurons that they received. This encourages users to remain active after the SNS launch and become governance participants.",
      "status": "future",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Nucleon"
    },
    {
      "title": "Fiat values in the NNS dapp",
      "overview": "It's hard to get a glance on one's SNS/ICP portfolio by only seeing the number of tokens held. This feature aims to show USD values of tokens, which also makes ordering more meaningful.",
      "description": "It's hard to get a glance on one's SNS/ICP portfolio by only seeing the number of tokens held. This feature aims to show USD values of tokens, which also makes ordering more meaningful.",
      "status": "deployed",
      "milestone_id": "Neon"
    },
    {
      "title": "Incentivise exceptional voting",
      "overview": "All ICP governance participants are rewarded equally whether they vote manually or follow other neurons, even if the former takes significantly more effort. This roadmap item aims to explore ways to find a better balance.",
      "status": "future",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Nucleon"
    },
    {
      "title": "NNS known and named neurons",
      "overview": "Currently there are a lot of known neurons and some that only focus on a few topics. It is hard for users to find good candidates to follow / delegate their  vote to for different topics. This feature aims to improve this and to consider introducing names also for other public neurons.",
      "status": "future",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Nucleon"
    },
    {
      "title": "NNS FE Dapp Re-write",
      "overview": "Replacing Flutter with Svelte for the NNS Frontend dapp. Significant speed and UX improvements expected.",
      "description": "The NNS FE dapp introduced at genesis was built on Flutter with mediocre usability. This feature replaces Flutter with Svelte — a technology stack better suited for the Internet Computer. The replacement led to significant improvements in dapp speed and user interface.",
      "forum": "https://forum.dfinity.org/t/nns-dapp-towards-new-ui-ux-including-test-link/13952",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "July 2022",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "NNS spam protection (remove financial incentive)",
      "overview": "Protecting the NNS against proposal spam by removing the financial incentive for such spam by allocating voting rewards differently.",
      "description": "This roadmap item is based on the community proposal 80970. In the current voting reward set-up, there is a financial incentive for spam because the overall reward pot is always handed out and by submitting governance spam propoals you can skew the voting reward allocation. This change removes this incentive by allocating voting rewards under the assumption that every neuron voted on everything. This change also includes moving the governance weight back to 20 and the tracking of allocated vs not allocated voting rewards.",
      "forum": "https://forum.dfinity.org/t/reproposal-spam-prevention-convert-from-system-based-rewards-to-voter-based-rewards/15352/1",
      "proposal": "https://dashboard.internetcomputer.org/proposal/80970",
      "wiki": "",
      "docs": "",
      "eta": "Q1 23",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Carbon Footprint and Sustainability Policy",
      "overview": "Conducting a carbon footprint / environmental impact assessment of ICP. Footprint of a subnet, source of electricity, total environmental cost of a tx on ICP.",
      "description": "This roadmap item is based on the community proposal 55487. Step 1: Conduct a carbon footprint / environmental impact assessment — either through internal resources or hiring an external consultant to answer basic questions about what the carbon footprint of running an IC Subnet is, where that electricity is sourced, and what the total cost per transaction is on the IC blockchain. Based on the learnings define more activities. Update: The Internet Computer Footprint Report is now available [here](https://assets.carboncrowd.io/reports/ICF.pdf). Step 2: “Energy consumption” reporting panel to the IC Network Status dashboard.  Update: Power/Energy consumption is now reported in real time on the IC Dashboard homepage, as well as individually for given nodes, see example node [here](https://dashboard.internetcomputer.org/node/25p5a-3yzir-ifqqt-5lggj-g4nxg-v2qe2-vxw57-qkxtd-wjohn-kfbfp-bqe). Carbon Crowd also launched a [Sustainability Dashboard](https://app.carboncrowd.io/).",
      "forum": "https://forum.dfinity.org/t/sustainability-nns-proposal/11976",
      "proposal": "https://dashboard.internetcomputer.org/proposal/55487",
      "wiki": "",
      "docs": "",
      "eta": "Q2 23",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Service Nervous System (SNS)",
      "overview": "A DAO factory that allows for proposal-based no-code creation of a DAO, including an initial decentralization swap. Available as part of the ICP governance framework.",
      "description": "This SNS rollout will include several features: **1.** SNSes that are provided as a protocol function (deployed on an SNS subnet and facilitating maintainable upgrades), **2.** A first version of voting rewards for SNSes that can be further customised in the future, **3.** Decentralization swaps that decentralize a dapp, where participants provide ICP tokens in exchange for SNS tokens. **4.** A NNS frontend dapp extension that allows end users to participate in the decentralization swap. **5.** Tooling to help users initialize an SNS.",
      "forum": "",
      "proposal": "https://dashboard.internetcomputer.org/proposal/65132",
      "wiki": "",
      "docs": "",
      "eta": "Q1 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Community Fund",
      "overview": "A first version of a community fund that provides means for the NNS community to have a \"treasury\" to invest in projects on ICP.",
      "description": "This feature implements a first version of a community fund that provides means for the NNS community to have a \"treasury\" to invest in projects on the Internet Computer. In this first version neurons which have enabled the “community fund” feature may expose their maturity to the decisions of the NNS to invest in SNS decentalization swaps. Note: This feature has been renamed to “Neuron's Fund” later.",
      "forum": "https://forum.dfinity.org/t/community-fund-revised-design-proposal/14691",
      "proposal": "https://dashboard.internetcomputer.org/proposal/74820",
      "wiki": "",
      "docs": "",
      "eta": "Q1 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Restriction for SNS swap participation",
      "overview": "Constraining participation in decentralization swaps of SNSes based on geographic location. Includes custom disclaimers to be confirmed by users before participating.",
      "description": "When an SNS is launched, it goes through a decentralization swap. During the swap, participants provide ICP and in return receive a share of the SNS DAO’s governance power in the form of SNS neurons. In the current design, swaps are open for anyone to participate. Different projects in the community have requested a feature that allows SNSes to restrict participation in the swap by geographic location. In addition, this feature enables swap participants to be presented with a custom confirmation text that they need to confirm before being allowed to participate.",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "Q2 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "One-proposal SNS initialization",
      "overview": "Simplifying decentralization of a dapp from two NNS proposals plus manual steps to a single proposal.",
      "description": "Currently, the process of decentralizing a dapp through the SNS platform requires two NNS proposals plus a few manual steps. Once this feature is implemented, the creation of a SNS will be done by a single proposal which the NNS community votes on.",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "Q3 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Neurons' Fund Enhancements: Matched Funding",
      "overview": "Enhancing the Neuron's Fund, e.g., to scale with swap participation by the community or having a 10% cap on participation.",
      "description": "Based on collected experience and community feedback from recent SNS launches and forum discussions, we propose four enhancements to the Community Fund framework: Introduction of a ‘Matched Funding’ scheme: Instead of a fixed ICP amount, the fund’s contribution to SNS swaps should scale in line with direct participation, i.e., match the funding of the Neuron's Fund with the organic funding received during the SNS launch, allowing for a more accurate reflection of market signals. Implementation of a 10% Participation Cap: To streamline adjustments when neurons opt out during SNS proposal voting, we suggest a cap in relationship to the totals funds available. This ensures the fund’s contribution to a single SNS never exceeds 10% of the total available funds at the proposal execution time. Consequently, this automatically adjusts the fund’s participation if neurons opt out. Renaming of the ‘Community Fund’ to ‘Neurons’ Fund’: This change aims to clarify misconceptions about the fund. It emphasizes that the fund comprises neurons owned by private individuals who are exposing their maturity to promising SNS DAOs. It is suggested to release this cosmetic change next week. Reduction of the Maximum Swap Duration: A potential fund contribution is tied up and cannot be utilized for other SNS launches for the duration of the swap. To prevent a potentially unsuccessful swap from blocking a fund contribution for an extended period, we propose shortening the maximum swap duration from the current 90 days to 14 days.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "December 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Ability to mint SNS tokens and revised thresholds for voting",
      "overview": "",
      "description": "Some SNS projects have requested SNS token minting functionality to fine tune the DAO's tokenomics. This feature implements token minting for SNS projects. In addition, this feature defines some of the SNS proposals as critical and increases their voting thresholds. See the forum link for the details.",
      "forum": "https://forum.dfinity.org/t/new-sns-ability-to-mint-sns-tokens-revised-thresholds-for-voting/23382",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "Q1 24",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Node Provider Remuneration V2",
      "overview": "The remuneration scheme v2 improves on the original v1 scheme by reducing remuneration for regions having already many nodes and reducing also for additional nodes of a node provider.",
      "description": "For the further growth of the IC network, the NNS agreed on a new replica hardware specification. The new specification is generic, i.e. not vendor specific. It is ready for upcoming ICP improvements. For example, it supports VM memory encryption and attestation which will further increase the security of dapps running on ICP. The new specification results in different captical expenses for the independent node providers running replica nodes. Consequently, a new NP reward structure (remuneration) is required. Based on feedback and discussion within the community, this remuneration is based on: — Higher rewards for the first nodes of a new NP in order to attract more NPs in an effort to improve ownership decentralization. — More refined rewards for nodes in new geographies, like South America, Africa, Asia and Australia, to stimulate further geographical decentralization. IC wiki: https://wiki.internetcomputer.org/wiki/Node_Provider_Remuneration",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Enable ICRC-2 for SNS ledgers",
      "overview": "Update the SNS framework to enable the rollout of ICRC-2 on the SNSes’ ledger canisters.",
      "description": "",
      "status": "deployed",
      "eta": "Q1 2024",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Safeguards for critical SNS proposals, including the SNS treasury",
      "overview": "Additional safeguards for transferring funds from an SNS treasury.",
      "description": "Some SNS proposals are more critical than others in that they have a big impact. This feature introduces additional measures to make it harder for them to be adopted, such as requiring a higher approval threshold. In addition, this feature introduces limits for treasury and minting proposals.",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "Q1 2024",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Update of SNS ledger parameters",
      "overview": "Enables parameters of SNS ledgers, such as the SNS token name, to be updated through SNS upgrade proposals.",
      "description": "",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Increase reward for SNS launch proposals to 20",
      "overview": "Increase the reward weight of NNS proposals of topic \"SNS & Neuron’s Fund\" to 20 to incentivize more active voting and have the same rules as for proposals of topic \"Governance\"",
      "description": "",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },

    {
      "title": "Reduce min dissolve delay to 3 months",
      "overview": "To lower the barrier of entry for new stakers and make liquid staking protocols more viable, the community adopted a motion proposal to reduce min dissovle delay to 3 months.",
      "description": "To lower the barrier of entry for new stakers and make liquid staking protocols more viable, the community adopted a motion proposal to reduce min dissovle delay to 3 months.",
      "forum": "https://forum.dfinity.org/t/reducing-the-minimum-dissolve-delay-to-3-months/32714",
      "proposal": "https://dashboard.internetcomputer.org/proposal/131010",
      "wiki": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": true,
      "in_beta": false
    },
    {
      "title": "Ledger support for SNS tokens",
      "overview": "Allow users to hold and control SNS tokens and neurons using their Ledger hardware wallet.",
      "description": "Allow users to hold and control SNS tokens and neurons using their Ledger hardware wallet.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Earn badges for activities",
      "overview": "Depending on different activities, reward users with badges in the NNS dapp such as #8YearGang.",
      "description": "Depending on different activities, reward users with badges in the NNS dapp such as #8YearGang.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Proposal error visibility",
      "overview": "Make it easier for SNS communities to execute decisions via proposals by making potential errors visible. For example, if an SNS proposal fails to execute, users of the NNS dapp do not see the reason for why this happened. This feature introduces user-readable error messages.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Nucleon"
    },
    {
      "title": "Expand reporting functionality",
      "overview": "Extending the reporting functionality, for example with SNS neurons or fiat values.",
      "status": "future",
      "milestone_id": "Nucleon"
    },
    {
      "title": "Governance basic portfolio reporting capabilities",
      "overview": "Reporting functionality that allows users to obtain summary information about their NNS neurons.",
      "status": "deployed",
      "milestone_id": "Neon"
    },

    {
      "title": "Allow ecosystem wallets to connect to the NNS dapp",
      "overview": "Allow ecosystem wallets to control tokens and governance neurons in the NNS dapp to foster an interoperable ICP ecosystem.",
      "description": "The ICRC signer standards are being developed in collaboration with the ICP community to enable secure, and standardized communication between canisters. Adopting ICRC signer standards will foster an ecosystem of ICP dapps where the end-user has full control over their tokens, while managing them across dapps is much simplified. The NNS dapp will open up and provide an example implementation using these standards to allow ecosystem wallets to control assets in the NNS dapp. ICP wallets and dapps are encouraged to follow suit and together create an interoperable ICP ecosystem.",
      "status": "future",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Manual overwriting of following-triggered votes",
      "overview": "This feature enables manual (overwrite) voting throughout the entire voting period of governance proposals even when a neuron is following another neuron.",
      "description": "This feature enables manual (overwrite) voting throughout the entire voting period of governance proposals even when a neuron is following another neuron. This roadmap item is based on the community proposal 38985.",
      "forum": "https://forum.dfinity.org/t/proposal-to-enable-manual-voting-throughout-the-entire-voting-period-of-governance-proposals/9815",
      "proposal": "https://dashboard.internetcomputer.org/proposal/38985",
      "wiki": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Archiving of NNS proposals",
      "overview": "Storing NNS proposals long term instead of deleting them after a defined time period as done currently to increase transparency and accountability of governance.",
      "description": "Currently, NNS proposals are only kept for a limited time and are then deleted. This feature intends to archive governance proposals to enhance transparency and accountability of the governance system.",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Maintain neurons’ voting history",
      "overview": "Keeping the voting history of all neurons for better transparency and accountability of ICP governance.",
      "description": "Keeping the voting history of all neurons for better transparency and accountability of ICP governance.",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Private voting",
      "overview": "Private voting of neuron holders. This helps prevent leakage of information on how neurons voted to ensure that neuron holders can vote freely without fearing consequences.",
      "description": "Private voting of neuron holders. This helps prevent leakage of information on how neurons voted to ensure that neuron holders can vote freely without fearing consequences.",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "SNS cycles management",
      "overview": "Support better automation of top-up of cycles for SNS and SNS-managed canisters for better usability.",
      "description": "Support better automation of top-up of cycles for SNS and SNS-managed canisters for better usability.",
      "status": "",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "SNS swap participation with additional tokens",
      "overview": "Allow users to participate in SNS decentralization swaps with different tokens than ICP, e.g., ckBTC or ckETH. Also a combination of tokens may be applicable.",
      "description": "Allow users to participate in SNS decentralization swaps with different tokens than ICP, e.g., ckBTC or ckETH. Also a combination of tokens may be applicable.",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Neurons' Fund phase II",
      "overview": "Addresses the end-of-investment phase of the Neuron's Fund.",
      "description": "Addresses the end-of-investment phase of the Neuron's Fund.",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "",
      "status": "future",
      "is_community": false,
      "in_beta": false
    }
  ]
}
