{
  "categoryName": "Digital Assets",
  "categoryDescription": "DeFi protocols, real-word asset tokenization, and other digital asset solutions are strong drivers of Web3 adoption. ICP’s Chain Fusion capabilities, unparalleled scalability, and the ability to serve web assets from chain opens up novel digital asset classes. Moreover, it makes ICP an attractive platform to build multichain custody solutions and wallets.",
  "elements": [
    {
      "title": "Enterprise-grade ledgers",
      "description": "This milestone extends the ICRC suite of ledger standards to meet enterprise requirements, unlocking key use cases such as stablecoins, Utopia, and the tokenization of real-world assets, driving the future of trustless digital asset management on the Internet Computer.",
      "status": "in_progress",
      "is_milestone": true,
      "milestone_id": "Nexus",
      "eta_to_render": ""
    },
    {
      "title": "CMTAT ledger",
      "overview": "Building a secure and scalable ledger on the Internet Computer with transparent access control management. By adhering to the CMTAT standard, management access remains verifiable and auditable, ensuring regulatory compliance.",
      "status": "in_progress",
      "milestone_id": "Nexus"
    },
        {
      "title": "Zero to Degen-Hero",
      "description": "This milestone aims at boosting the ICP DeFi ecosystem by simplifying the discovery of new tokens, creating more transparency into who controls ledgers, and a more streamlined user experience between DeFi dapps.",
      "status": "in_progress",
      "is_milestone": true,
      "milestone_id": "Apex",
      "eta_to_render": ""
    },
    {
      "title": "Ledgers as a first class citizen on ICP",
      "overview": "Ledgers are an important part of the blockchain ecosystem. Making it easy to create, discover, and use is fundamental to greater adoption.",
      "status": "future",
      "milestone_id": "Apex"
    },
    {
      "title": "Faster institutional integrations of new tokens",
      "overview": "Support multi-token Rosetta",
      "status": "deployed",
      "milestone_id": "Apex"
    },
    {
      "title": "Fiat on-ramp",
      "overview": "Facilitate the exchange of fiat currencies for ICP native tokens.",
      "status": "future",
      "milestone_id": "Apex"
    },
    {
      "title": "Expanded Orbit framework",
      "description": "Orbit is a secure solution for digital assets and smart contract management, and this milestone will broaden its asset management capabilities by enabling seamless integration of native tokens from other blockchains, starting with ETH and ERC-20. This will create a unified platform for treasury management, allowing users to securely sign and send transactions across multiple chains. Additionally, we will introduce automatic smart contract upgrades, ensuring that users always have access to the latest security updates and features with minimal manual intervention.",
      "status": "future",
      "is_milestone": true,
      "milestone_id": "Echelon",
      "eta_to_render": ""
    },
    {
      "title": "ETH and ERC-20 integration",
      "overview": "Users will be able to sign and send ETH transactions through their Orbit Station, leveraging the Internet Computer EVM RPC canister.",
      "status": "future",
      "milestone_id": "Echelon"
    },
    {
      "title": "Automatic upgrades",
      "overview": "A streamlined update system will allow users to subscribe for automatic contract updates, ensuring they stay on the latest secure version without manual intervention.",
      "status": "future",
      "milestone_id": "Echelon"
    },
    {
      "title": "Off app notifications",
      "overview": "Orbit’s core approval policies operate asynchronously, facilitating collaboration across multiple users. To enhance this experience, we will introduce more notification options, ensuring users stay informed and engaged with pending approvals or updates.",
      "status": "future",
      "milestone_id": "Echelon"
    },
    {
      "title": "Orbit Wallet v1",
      "description": "To further improve Orbit’s usability and accessibility, we will enhance the user experience through intuitive approval flows, a revamped onboarding, and a comprehensive documentation hub. These improvements will ensure the Orbit App is efficient for both individual users and teams managing their digital assets management needs.",
      "status": "future",
      "is_milestone": true,
      "milestone_id": "Neutron",
      "eta_to_render": ""
    },
    {
      "title": "Documentation hub",
      "overview": "A knowledge base providing in-depth guidance on Orbit’s core concepts, approval policies, and example configurations, structured under the Orbit System Configuration & Approval Policy (OSCAP) framework.",
      "status": "future",
      "milestone_id": "Neutron"
    },
    {
      "title": "Onboarding",
      "overview": "A more guided, interactive onboarding flow will help new users quickly configure their Orbit Station, set up approval policies, and integrate assets with minimal friction.",
      "status": "future",
      "milestone_id": "Neutron"
    },
    {
      "title": "UX improvements",
      "overview": "A revamped configuration flow will simplify the setup of Orbit Station, making it easier for users of all technical levels to integrate smart contracts and manage assets.",
      "status": "future",
      "milestone_id": "Neutron"
    },
    {
      "title": "Decentralized marketplace for sovereign apps",
      "description": "A new foundation for a decentralized software marketplace is built, providing developers with a clear path to adoption for their applications without reliance on centralized platforms. By integrating transparent deployment flows and seamless discovery tools, this initiative lays the groundwork for a sovereign software ecosystem where developers can easily package and distribute their applications, and users retain full control over their installed apps.",
      "status": "future",
      "is_milestone": true,
      "milestone_id": "Dynamo",
      "eta_to_render": ""
    },
    {
      "title": "Developer packaging & submission tools",
      "overview": "Tools to streamline app packaging, validation, and deployment, ensuring a smooth onboarding experience for developers.",
      "status": "future",
      "milestone_id": "Dynamo"
    },
    {
      "title": "App manager",
      "overview": "A dashboard where users can manage installed applications, providing an intuitive way to access and control their apps.",
      "status": "future",
      "milestone_id": "Dynamo"
    },
    {
      "title": "Core marketplace framework",
      "overview": "A decentralized app catalog where developers can publish applications with metadata (version, description, screenshots). Users can search, filter, and explore categorized apps effortlessly.",
      "status": "future",
      "milestone_id": "Dynamo"
    },
    {
      "title": "First sovereign productivity apps",
      "overview": "A set of initial applications designed to showcase the power of sovereign software, serving as reference for future developers.",
      "status": "future",
      "milestone_id": "Dynamo"
    },
    {
      "title": "Rosetta for ICRC ledgers",
      "overview": "Implement the Rosetta standard for ICRC-based ledgers. Enables ICRC tokens to be handled by centralized exchanges.",
      "status": "in_progress",
      "eta": "2024",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": true,
      "in_beta": false
    },
    {
      "title": "Trust Wallet integration",
      "overview": "Integrating ICP with the widely-used Trust Wallet project to facilitate adoption of ICP beyond the current audience.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "in_progress",
      "is_community": true,
      "in_beta": false
    },
    {
      "title": "ICRC-4: batch transfers for fungible tokens standard",
      "overview": "Extension standard for ICRC-1 defining batch transfers for ICRC-1 tokens. Batching transactions improves throughput and can reduce cost.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "in_progress",
      "is_community": true,
      "in_beta": false
    },
    {
      "title": "ICRC-21 canister call consent messages",
      "overview": "Standard for a protocol for obtaining human-readable consent messages for canister calls.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "in_progress",
      "is_community": true,
      "in_beta": false
    },
    {
      "title": "ICRC-22 payment request formats",
      "overview": "Standard for expressing payment requests for tokens on ICP as URLs and thus also QR codes.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "in_progress",
      "is_community": true,
      "in_beta": false
    },
    {
      "title": "Implement ICRC-21 in Ledger devices",
      "overview": "The implmentation of ICRC-21 in Ledger devices will allow us to support generic transactions.",
      "status": "in_progress",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Chain-key token (ck token) support in the ICP wallet",
      "overview": "Support for chain-key tokens (ck tokens) in the ICP wallet.",
      "status": "",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Ledger Live staking integration",
      "overview": "Ledger live acquires the ability to stake ICP.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "",
      "is_community": true,
      "in_beta": false
    },
    {
      "title": "ICRC-7/-37 NFT standard in mobile wallets",
      "overview": "Bringing the ICRC-7 and ICRC-37 standards for NFTs on ICP to mobile wallets.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "",
      "is_community": true,
      "in_beta": false
    },
    {
      "title": "Institutional custody integration for custody & staking of ICP and ICRC tokens",
      "overview": "An integration of the Internet Computer blockchain with institutional custody providers to support custody and staking for ICP and ICRC tokens.",
      "status": "",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Ledger metrics",
      "overview": "This feature collects and exposes certain metrics of ledgers on the Internet Computer. Both the ICP ledger as well as ICRC-1/-2/-3 ledgers receive metrics support.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "",
      "is_community": true,
      "in_beta": false
    }
  ]
}
