{
  "categoryName": "",
  "categoryDescription": "",
  "elements": [
    {
      "title": "Oisy ownership model",
      "overview": "Shift Oisy's ownership model to a canister-per-user model. Under this change, the digital assets for each Oisy user will reside in a user-controlled canister.",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Toroidal"
    },
    {
      "title": "Oisy Beta Launch",
      "overview": "Make the Oisy wallet accessible to external users.",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "https://oisy.com/",
      "is_community": false,
      "in_beta": true,
      "milestone_id": "Toroidal"
    },
    {
      "title": "Signer standards in Oisy",
      "overview": "Oisy is upgraded to support the signer standards to foster a vibrant and diverse ecosystem of signers and relying parties. Users can then safely transact with digital assets using their Oisy wallet and signer standards compatible dApps.",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Toroidal"
    },
    {
      "title": "Oisy, a Multi-chain Wallet Powered by Chain Fusion",
      "is_milestone": true,
      "description": "Oisy is a wallet with a unique combination of properties. It is the first smart contract wallet that is self-custodial, multi-chain and uses passkeys for authentication, while being fully accessible through the browser. Oisy supports ICP-based dapps through ICRC-21, EVM-based dapps through WalletConnect, and easily converts between native Ethereum tokens and their ck twins.",
      "milestone_id": "Toroidal",
      "status": "deployed",
      "eta": "2024-12",
      "eta_to_render": "November 2024"
    },
    {
      "title": "ICRC-1: Fungible tokens on ICP",
      "overview": "Fungible token standard for the Internet Computer, improving on the ICP token standard. Accounts using principal-subaccount pairs instead of hashed addresses.",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "ICRC-2: Approve and transfer_from for ICRC-1 tokens",
      "overview": "Extending ICRC-1 with ERC-20-stlye approve / transfer_from functionality, but enhanced for the IC.",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Oisy",
      "overview": "Network custodial wallet for EVM blockchains. Naming derived from Open-Internet-Services-like (OISy).",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "ICRC-3: transaction log for ICRC ledgers standard",
      "overview": "Standard for the transaction log format for ICRC ledgers. Prerequisite for unified integration of ICRC tokens with centralized exchanges.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "March 2024",
      "status": "deployed",
      "is_community": true,
      "in_beta": false
    },
    {
      "title": "On-ramp for ICP and other tokens",
      "overview": "On-ramping for ICP and further tokens to simplify the onboarding experience",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "ICRC-7: Basic non-fungible token (NFT) standard",
      "overview": "Basic non-fungible token (NFT) standard for the Internet Computer featuring batch APIs.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": true,
      "in_beta": false
    },
    {
      "title": "ICRC-37: Approve / transfer_from extension for ICRC-7.",
      "overview": "Approve / transfer_from extension for the ICRC-7 basic NFT standard for the Internet Computer. Simplifies many scenarios by avoiding error scenarios of regular transfers.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": true,
      "in_beta": false
    },
    {
      "title": "ICRC-3 implementation for ICRC-1 ledgers",
      "overview": "Implementation of the ICRC-3 transaction log standard for the ICRC-1 ledger implementation and rollout to SNS, ckBTC, and ckETH ledger deployments.",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "is_community": true,
      "in_beta": false
    },
    {
      "title": "Solana Integration",
      "overview": "OISY widens its multi-chain reach beyond Bitcoin and Ethereum, and will integrate with the most important networks. Solana is the first one to be implemented, a crucial step forward in our mission to deliver a true multi-chain wallet for decentralized finance (DeFi) users.",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Helios"
    },
    {
      "title": "In-Wallet Swaps",
      "overview": "Introducing in-wallet swaps, this release will enhance flexibility for managing assets, allowing users to seamlessly change their asset allocation directly in OISY using DEX liquidity, mitigating risk or aiming for a higher yield.",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Helios"
    },
    {
      "title": "Promote Chain-Key Tokens",
      "overview": "With improved screens, flows, and helper texts for chain fusion conversions, OISY will provide users with the right information at the right places to make informed decisions to easily convert native tokens into their chain fusion twins or vice versa.",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Helios"
    },
    {
      "title": "OISY Wallet v1.0 - The official Launch",
      "description": "With the Helios release, officially named v1.0, OISY will step out of the beta status into its first production version. This includes functional coverage of all key features like buy, receive, send, swap, and convert from and to chain-key tokens, and with several major blockchains integrated, also a true multi-chain nature. Behind the scenes, it also includes setting up proper processes for product improvement, marketing, automated testing, and setting up a user friendly support process.",
      "is_milestone": true,
      "milestone_id": "Helios",
      "status": "deployed",
      "eta": "",
      "eta_to_render": "February 2025"
    },
    {
      "title": "Orbit Multi custody wallet for ICP",
      "overview": "Users can securely share ownership of the ICP token with a fully onchain wallet. From simple 1-out-of-2 configurations to sophisticated approval policy rules, Orbit provides comprehensive support for secure financial transactions with a flexible user-role-based system.",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Poloidal"
    },
    {
      "title": "Secure canister management",
      "overview": "Teams building their product vision require secure shared access to dapp control. Orbit's rule engine enables policies specifying how many users are needed to approve canister management operations like upgrades and installations, preventing a single member from seizing control.",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Poloidal"
    },
    {
      "title": "Orbit supports ICRC-1",
      "overview": "Users can manage non-ICP tokens like ckBTC and ckETH with confidence using Orbit's advanced security features, ensuring secure multi-token management.",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Poloidal"
    },
    {
      "title": "The Orbit multi-custody asset framework",
      "description": "Orbit is a comprehensive digital assets framework, enabling simple to advanced rules over user digital assets. Initially tailored for token management, it provides robust support for 1-out-of-M to complex approval policies for financial transactions. It also supports secure management of infrastructure like canister installations and upgrades. Teams and businesses can confidently handle ICP, ckETH, and compatible tokens using Orbit's advanced security features, vital for those seeking a stable and reliable management over their treasury.",
      "is_milestone": true,
      "milestone_id": "Poloidal",
      "status": "deployed",
      "eta": "",
      "eta_to_render": "March 2025"
    }
  ]
}