{
  "categoryName": "",
  "categoryDescription": "",
  "elements": [
    {
      "title": "Update of SNS ledger parameters",
      "overview": "Enables parameters of SNS ledgers, such as the SNS token name, to be updated through SNS upgrade proposals.",
      "description": "",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Increase reward for SNS launch proposals to 20",
      "overview": "Increase the reward weight of NNS proposals of topic \"SNS & Neuron’s Fund\" to 20 to incentivize more active voting and have the same rules as for proposals of topic \"Governance\"",
      "description": "",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "NNS FE dapp re-write",
      "overview": "Replacing Flutter with Svelte for the NNS Frontend dapp. Significant speed and UX improvements expected.",
      "description": "The NNS FE dapp introduced at genesis was built on Flutter with mediocre usability. This feature replaces Flutter with Svelte — a technology stack better suited for the Internet Computer. The replacement led to significant improvements in dapp speed and user interface.",
      "forum": "https://forum.dfinity.org/t/nns-dapp-towards-new-ui-ux-including-test-link/13952",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "July 2022",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "NNS spam protection (remove financial incentive)",
      "overview": "Protecting the NNS against proposal spam by removing the financial incentive for such spam by allocating voting rewards differently.",
      "description": "This roadmap item is based on the community proposal 80970. In the current voting reward set-up, there is a financial incentive for spam because the overall reward pot is always handed out and by submitting governance spam propoals you can skew the voting reward allocation. This change removes this incentive by allocating voting rewards under the assumption that every neuron voted on everything. This change also includes moving the governance weight back to 20 and the tracking of allocated vs not allocated voting rewards.",
      "forum": "https://forum.dfinity.org/t/reproposal-spam-prevention-convert-from-system-based-rewards-to-voter-based-rewards/15352/1",
      "proposal": "https://dashboard.internetcomputer.org/proposal/80970",
      "wiki": "",
      "docs": "",
      "eta": "Q1 23",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Carbon footprint and sustainability Policy",
      "overview": "Conducting a carbon footprint / environmental impact assessment of ICP. Footprint of a subnet, source of electricity, total environmental cost of a tx on ICP.",
      "description": "This roadmap item is based on the community proposal 55487. Step 1: Conduct a carbon footprint / environmental impact assessment — either through internal resources or hiring an external consultant to answer basic questions about what the carbon footprint of running an IC Subnet is, where that electricity is sourced, and what the total cost per transaction is on the IC blockchain. Based on the learnings define more activities. Update: The Internet Computer Footprint Report is now available [here](https://assets.carboncrowd.io/reports/ICF.pdf). Step 2: “Energy consumption” reporting panel to the IC Network Status dashboard.  Update: Power/Energy consumption is now reported in real time on the IC Dashboard homepage, as well as individually for given nodes, see example node [here](https://dashboard.internetcomputer.org/node/25p5a-3yzir-ifqqt-5lggj-g4nxg-v2qe2-vxw57-qkxtd-wjohn-kfbfp-bqe). Carbon Crowd also launched a [Sustainability Dashboard](https://app.carboncrowd.io/).",
      "forum": "https://forum.dfinity.org/t/sustainability-nns-proposal/11976",
      "proposal": "https://dashboard.internetcomputer.org/proposal/55487",
      "wiki": "",
      "docs": "",
      "eta": "Q2 23",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Service Nervous System (SNS)",
      "overview": "A DAO factory that allows for proposal-based no-code creation of a DAO, including an initial decentralization swap. Available as part of the ICP governance framework.",
      "description": "This SNS rollout will include several features: **1.** SNSes that are provided as a protocol function (deployed on an SNS subnet and facilitating maintainable upgrades), **2.** A first version of voting rewards for SNSes that can be further customised in the future, **3.** Decentralization swaps that decentralize a dapp, where participants provide ICP tokens in exchange for SNS tokens. **4.** A NNS frontend dapp extension that allows end users to participate in the decentralization swap. **5.** Tooling to help users initialize an SNS.",
      "forum": "",
      "proposal": "https://dashboard.internetcomputer.org/proposal/65132",
      "wiki": "",
      "docs": "",
      "eta": "Q1 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Community fund",
      "overview": "A first version of a community fund that provides means for the NNS community to have a \"treasury\" to invest in projects on ICP.",
      "description": "This feature implements a first version of a community fund that provides means for the NNS community to have a \"treasury\" to invest in projects on the Internet Computer. In this first version neurons which have enabled the “community fund” feature may expose their maturity to the decisions of the NNS to invest in SNS decentalization swaps. Note: This feature has been renamed to “Neuron's Fund” later.",
      "forum": "https://forum.dfinity.org/t/community-fund-revised-design-proposal/14691",
      "proposal": "https://dashboard.internetcomputer.org/proposal/74820",
      "wiki": "",
      "docs": "",
      "eta": "Q1 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Restriction for SNS swap participation",
      "overview": "Constraining participation in decentralization swaps of SNSes based on geographic location. Includes custom disclaimers to be confirmed by users before participating.",
      "description": "When an SNS is launched, it goes through a decentralization swap. During the swap, participants provide ICP and in return receive a share of the SNS DAO’s governance power in the form of SNS neurons. In the current design, swaps are open for anyone to participate. Different projects in the community have requested a feature that allows SNSes to restrict participation in the swap by geographic location. In addition, this feature enables swap participants to be presented with a custom confirmation text that they need to confirm before being allowed to participate.",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "Q2 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "One-proposal SNS initialization",
      "overview": "Simplifying decentralization of a dapp from two NNS proposals plus manual steps to a single proposal.",
      "description": "Currently, the process of decentralizing a dapp through the SNS platform requires two NNS proposals plus a few manual steps. Once this feature is implemented, the creation of a SNS will be done by a single proposal which the NNS community votes on.",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "Q3 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Neurons' fund enhancements: matched funding",
      "overview": "Enhancing the Neuron's Fund, e.g., to scale with swap participation by the community or having a 10% cap on participation.",
      "description": "Based on collected experience and community feedback from recent SNS launches and forum discussions, we propose four enhancements to the Community Fund framework: Introduction of a ‘Matched Funding’ scheme: Instead of a fixed ICP amount, the fund’s contribution to SNS swaps should scale in line with direct participation, i.e., match the funding of the Neuron's Fund with the organic funding received during the SNS launch, allowing for a more accurate reflection of market signals. Implementation of a 10% Participation Cap: To streamline adjustments when neurons opt out during SNS proposal voting, we suggest a cap in relationship to the totals funds available. This ensures the fund’s contribution to a single SNS never exceeds 10% of the total available funds at the proposal execution time. Consequently, this automatically adjusts the fund’s participation if neurons opt out. Renaming of the ‘Community Fund’ to ‘Neurons’ Fund’: This change aims to clarify misconceptions about the fund. It emphasizes that the fund comprises neurons owned by private individuals who are exposing their maturity to promising SNS DAOs. It is suggested to release this cosmetic change next week. Reduction of the Maximum Swap Duration: A potential fund contribution is tied up and cannot be utilized for other SNS launches for the duration of the swap. To prevent a potentially unsuccessful swap from blocking a fund contribution for an extended period, we propose shortening the maximum swap duration from the current 90 days to 14 days.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "December 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Ability to mint SNS tokens and revised thresholds for voting",
      "overview": "",
      "description": "Some SNS projects have requested SNS token minting functionality to fine tune the DAO's tokenomics. This feature implements token minting for SNS projects. In addition, this feature defines some of the SNS proposals as critical and increases their voting thresholds. See the forum link for the details.",
      "forum": "https://forum.dfinity.org/t/new-sns-ability-to-mint-sns-tokens-revised-thresholds-for-voting/23382",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "Q1 24",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Node provider remuneration V2",
      "overview": "The remuneration scheme v2 improves on the original v1 scheme by reducing remuneration for regions having already many nodes and reducing also for additional nodes of a node provider.",
      "description": "For the further growth of the IC network, the NNS agreed on a new replica hardware specification. The new specification is generic, i.e. not vendor specific. It is ready for upcoming ICP improvements. For example, it supports VM memory encryption and attestation which will further increase the security of dapps running on ICP. The new specification results in different captical expenses for the independent node providers running replica nodes. Consequently, a new NP reward structure (remuneration) is required. Based on feedback and discussion within the community, this remuneration is based on: — Higher rewards for the first nodes of a new NP in order to attract more NPs in an effort to improve ownership decentralization. — More refined rewards for nodes in new geographies, like South America, Africa, Asia and Australia, to stimulate further geographical decentralization. IC wiki: https://wiki.internetcomputer.org/wiki/Node_Provider_Remuneration",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Enable ICRC-2 for SNS ledgers",
      "overview": "Update the SNS framework to enable the rollout of ICRC-2 on the SNSes’ ledger canisters.",
      "description": "",
      "status": "deployed",
      "eta": "Q1 2024",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Safeguards for critical SNS proposals, including the SNS treasury",
      "overview": "Additional safeguards for transferring funds from an SNS treasury.",
      "description": "Some SNS proposals are more critical than others in that they have a big impact. This feature introduces additional measures to make it harder for them to be adopted, such as requiring a higher approval threshold. In addition, this feature introduces limits for treasury and minting proposals.",
      "forum": "",
      "proposal": "",
      "wiki": "",
      "docs": "",
      "eta": "Q1 2024",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Active Liquid Democracy",
      "is_milestone": true,
      "description": "The NNS and SNS DAOs facilitate active liquid democracies by lowering the entry barrier for participation and providing better inputs for well-informed decisions. This includes direct voting as well as delegating some voting decisions to others. As a result, more users stake tokens and participate in DAOs to form lively communities. The resulting network effects foster additional adoption and growth.",
      "milestone_id": "Plasma",
      "status": "deployed",
      "eta": "",
      "eta_to_render": "January 2025"
    },

    {
      "title": "Neurons table design",
      "overview": "The neurons table view provides several improvements over the grid layout from the initial design, making it easier for users to quickly get an overview of their neurons.",
      "description": "There are two interconnected tables in the proposed design. The projects table shows an overview of all projects a user holds neurons in, while the neurons table provides a detailed overview of neurons a user holds within one DAO.",
      "forum": "https://forum.dfinity.org/t/nns-dapp-feature-proposal-neurons-table-view/30750",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Plasma"
    },
    {
      "title": "Actionable proposals",
      "overview": "Show users which DAOs have proposals they can still vote on, so that users don't need to manually check every day",
      "description": "It can be easy to miss proposals from DAOs that users don't check frequently. To ensure that DAO participants never miss proposals, show users which DAOs have proposals they can vote on.",
      "forum": "https://forum.dfinity.org/t/showing-actionable-proposals-in-the-nns-dapp/28241",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Plasma"
    },
    {
      "title": "SNS name/logo change via proposal",
      "overview": "Several SNS DAOs have grown and evolved since they became SNS's. These communities should be able to rebrand themselves by changing their name, logo, and more via proposals.",
      "description": "Several SNS DAOs have grown and evolved since they became SNS's. These communities should be able to rebrand themselves by changing their name, logo, and more via proposals.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "milestone_id": "Plasma"
    },
    {
      "title": "Allow canisters to control neurons",
      "overview": "Some SNS DAOs are looking to use parts of their ICP treasury to stake in the NNS and participate in ICP's governance. This feature will allow SNS DAOs to stake in the NNS.",
      "description": "Some SNS DAOs are looking to use parts of their ICP treasury to stake in the NNS and participate in ICP's governance. This feature will allow SNS DAOs to stake in the NNS",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "milestone_id": "Plasma"
    },
    {
      "title": "Encourage active governance participation",
      "overview": "The NNS is at the heart of ICP constantly evolving the network. It is therefore crucial that developer teams and other members of the ICP community take an active role in verifying and voting on NNS proposals.",
      "description": "The NNS is at the heart of ICP constantly evolving the network. It is therefore crucial that developer teams and other members of the ICP community take an active role in verifying and voting on NNS proposals.",
      "forum": "https://forum.dfinity.org/t/grants-for-voting-neurons/32721",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "milestone_id": "Plasma"
    },
    {
      "title": "ICRC-1 token imports",
      "overview": "One of the most requested community features is to allow users of the NNS dapp to import any token that supports ICRC-1 to store in their account.",
      "description": "One of the most requested community features is to allow users of the NNS dapp to import any token that supports ICRC-1 to store in their account.",
      "forum": "https://forum.dfinity.org/t/feature-proposal-importing-tokens-to-the-nns-dapp/31230",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "milestone_id": "Plasma"
    },
    {
      "title": "Private & public neurons",
      "overview": "Introduce public and private neurons to enable creating a neuron index. Public neurons would expose additional information about themselves, including their ballots.",
      "description": "Public neurons provide more transparency to followers, while private neurons keep ballots confidential. This introduces more transparency by revealing all neurons’ IDs and their stake",
      "forum": "",
      "proposal": "",
      "docs": "https://internetcomputer.org/docs/building-apps/governing-apps/nns/concepts/neurons/neuron-management",
      "eta": "",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "milestone_id": "Plasma"
    },
    {
      "title": "Improved SNS upgrades",
      "overview": "Upgrading SNS canisters is crucial for SNS DAOs to receive the latest features and security updates. These updates are not straightforward and may require multiple proposals. This feature is about simplifying SNS upgrades.",
      "description": "Upgrading SNS canisters is crucial for SNS DAOs to receive the latest features and security updates. These updates are not straightforward and may require multiple proposals. This feature is about simplifying SNS upgrades.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "milestone_id": "Plasma"
    },
    {
      "title": "NNS FE Dapp Re-write",
      "overview": "Replacing Flutter with Svelte for the NNS Frontend dapp. Significant speed and UX improvements expected.",
      "forum": "https://forum.dfinity.org/t/nns-dapp-towards-new-ui-ux-including-test-link/13952",
      "proposal": "",
      "docs": "",
      "eta": "July 2022",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "NNS spam protection (remove financial incentive)",
      "overview": "Protecting the NNS against proposal spam by removing the financial incentive for such spam by allocating voting rewards differently.",
      "forum": "https://forum.dfinity.org/t/reproposal-spam-prevention-convert-from-system-based-rewards-to-voter-based-rewards/15352/1",
      "proposal": "https://dashboard.internetcomputer.org/proposal/80970",
      "docs": "",
      "eta": "Q1 23",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Carbon Footprint and Sustainability Policy",
      "overview": "Conducting a carbon footprint / environmental impact assessment of ICP. Footprint of a subnet, source of electricity, total environmental cost of a tx on ICP.",
      "forum": "https://forum.dfinity.org/t/sustainability-nns-proposal/11976",
      "proposal": "https://dashboard.internetcomputer.org/proposal/55487",
      "docs": "",
      "eta": "Q2 23",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Service Nervous System (SNS)",
      "overview": "A DAO factory that allows for proposal-based no-code creation of a DAO, including an initial decentralization swap. Available as part of the ICP governance framework.",
      "forum": "",
      "proposal": "https://dashboard.internetcomputer.org/proposal/65132",
      "docs": "",
      "eta": "Q1 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Community Fund",
      "overview": "A first version of a community fund that provides means for the NNS community to have a \"treasury\" to invest in projects on ICP.",
      "forum": "https://forum.dfinity.org/t/community-fund-revised-design-proposal/14691",
      "proposal": "https://dashboard.internetcomputer.org/proposal/74820",
      "docs": "",
      "eta": "Q1 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Restriction for SNS swap participation",
      "overview": "Constraining participation in decentralization swaps of SNSes based on geographic location. Includes custom disclaimers to be confirmed by users before participating.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "Q2 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "One-proposal SNS initialization",
      "overview": "Simplifying decentralization of a dapp from two NNS proposals plus manual steps to a single proposal.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "Q3 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Neurons' Fund Enhancements: Matched Funding",
      "overview": "Enhancing the Neuron's Fund, e.g., to scale with swap participation by the community or having a 10% cap on participation.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "December 23",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Ability to mint SNS tokens and revised thresholds for voting",
      "overview": "",
      "forum": "https://forum.dfinity.org/t/new-sns-ability-to-mint-sns-tokens-revised-thresholds-for-voting/23382",
      "proposal": "",
      "docs": "",
      "eta": "Q1 24",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Node Provider Remuneration V2",
      "overview": "The remuneration scheme v2 improves on the original v1 scheme by reducing remuneration for regions having already many nodes and reducing also for additional nodes of a node provider.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": true,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Enable ICRC-2 for SNS ledgers",
      "overview": "Update the SNS framework to enable the rollout of ICRC-2 on the SNSs’ ledger canisters.",
      "status": "deployed",
      "eta": "Q1 2024",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Safeguards for critical SNS proposals, including the SNS treasury",
      "overview": "Additional safeguards for transferring funds from an SNS treasury.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "Q1 2024",
      "status": "deployed",
      "is_community": false,
      "in_beta": false,
      "imported": true
    },
    {
      "title": "Update of SNS ledger parameters",
      "overview": "Enables parameters of SNS ledgers, such as the SNS token name, to be updated through SNS upgrade proposals.",
      "forum": "",
      "proposal": "",
      "docs": "",
      "eta": "",
      "status": "deployed",
      "is_community": false,
      "in_beta": false
    },
    {
      "title": "Increase reward for SNS launch proposals to 20",
      "overview": "Increase the reward weight of NNS proposals of topic \"SNS & Neuron’s Fund\" to 20 to incentivize more active voting and have the same rules as for proposals of topic \"Governance\"",
      "status": "deployed",
      "forum": "",
      "proposal": "",
      "docs": "",
      "is_community": false,
      "in_beta": false
    }
  ]
}